In [1]:
import pandas as pd

data = {'Name': ['John', 'Cateline', 'Matt', 'Oliver'],
        'ID': [1, 22, 23, 36]}

df = pd.DataFrame(data)

In [2]:
print(df)

       Name  ID
0      John   1
1  Cateline  22
2      Matt  23
3    Oliver  36

In [3]:
new_df = pd.get_dummies(df.Name)
new_df.head()

   Cateline  John  Matt  Oliver
0         0     1     0       0
1         1     0     0       0
2         0     0     1       0
3         0     0     0       1

In [4]:
df.describe()

              ID
count   4.000000
mean   20.500000
std    14.479871
min     1.000000
25%    16.750000
50%    22.500000
75%    26.250000
max    36.000000

In [11]:
df['ID'].mean()

20.5